In [15]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data/chinook.db')
db = conn.cursor()

,0,1,2,3,4,5,6,7,8
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94

1. Check which customers buy the most
What should i do:
- the table should have 3 columns which is the customersId, customers name and money they spent
- customers can be found in table customers with column FirstName LastName
- money they spent can be found in invoices with column total
- customers and invoice can be join by CustomerId
2. Problem I faced:
- i forget the order of searching and put order by after limit. limit should always be the last one
- String can be joined by using ||

In [38]:
db.execute(    
'''
select c.CustomerId, c.FirstName||' ' ||c.LastName as name,sum(total) as total_spending
from customers c join invoices i on c.CustomerId=i.CustomerId
group by name
order by total_spending desc
limit 3

''')
rows = db.fetchall()
pd.DataFrame(rows,columns=['cusomterID','name','total_spending'])

   cusomterID                name  total_spending
0           6         Helena Holý           49.62
1          26  Richard Cunningham           47.62
2          57          Luis Rojas           46.62

2. which Track sales the most
- I am looking for both amount of sales which can be found in total within invoices and count the number after groupby the album
- the table should have 3 columns trackId, sales, number of sales
- TrackId canbe found in the invoice_items, total from invoices table can be join by InvoiceId

Add-on:
- I should be able to use subquery to join the table with Track table to see the name of the track instead of just ID

In [56]:
db.execute(    
'''
select e.TrackId,t.name,sales,number_of_sales
from (
select TrackId,sum(total) as sales, count(i.InvoiceId) as number_of_sales
from invoices i join invoice_items t on i.InvoiceId=t.InvoiceId
group by TrackId
order by sales desc) as e join tracks t on e.TrackId=t.TrackId
limit 20

''')
rows = db.fetchall()
pd.DataFrame(rows,columns=['TrackId','name','number_of_sales','sales'])

    TrackId                                     name  number_of_sales  sales
0      2832                           The Woman King            43.77      2
1      2850                                  The Fix            43.77      2
2      2868                                Walkabout            43.77      2
3      3214                        Phyllis's Wedding            29.82      2
4      2814                               Insensível            25.86      1
5      2823                            Collaborators            25.86      1
6      2841                           One Giant Leap            25.86      1
7      2859  Man of Science, Man of Faith (Premiere)            25.86      1
8      2877                                 The Moth            25.86      1
9      2886               Stranger In a Strange Land            25.86      1
10     2895                                Par Avion            25.86      1
11     2904                                  Outlaws            25.86      1
12     2913                          Deus Ex Machina            25.86      1
13     2922          Live Together, Die Alone, Pt. 1            25.86      1
14     2931                                 So Cruel            25.86      1
15     2959                Hallelujah Here She Comes            25.82      2
16     2945                           Peace On Earth            24.85      2
17     2837                        Crossroads, Pt. 1            23.86      1
18     2846                Seven Minutes to Midnight            23.86      1
19     2855                              Company Man            23.86      1

3. what singer has the most diverse genre of music
- the connection should be TrackId from tracks >  join GenreId with genres and show g.Name > join AlbumId with albums and show a.ArtistId > join a.ArtistId with artists on art.Name

Problems:
- I think the biggest problem here is I dont know

In [67]:
db.execute(    
'''
select art.Name,count(Distinct(g.Name)) as number_of_distinct_genre
from tracks t join genres g on t.GenreId = g.GenreId join albums a on t.AlbumId = a.AlbumId 
join artists art on a.ArtistId=art.ArtistId
group by art.Name
order by number_of_distinct_genre desc
limit 20

''')
rows = db.fetchall()
pd.DataFrame(rows,columns=['name','number_of_distinct_genre'])

                     name  number_of_distinct_genre
0             Iron Maiden                         4
1         Various Artists                         3
2           Lenny Kravitz                         3
3              Jamiroquai                         3
4            Gilberto Gil                         3
5    Battlestar Galactica                         3
6              Audioslave                         3
7                      U2                         2
8              The Office                         2
9   Red Hot Chili Peppers                         2
10                 R.E.M.                         2
11              Pearl Jam                         2
12          Ozzy Osbourne                         2
13                   Lost                         2
14                 Heroes                         2
15          Guns N' Roses                         2
16           Foo Fighters                         2
17          Faith No More                         2
18           Eric Clapton                         2
19   Antônio Carlos Jobim                         2

4. which singer earn the most

In [14]:
!git add Untitled.ipynb
!git commit -m 'updated database for practice'
!git push origin master

[master (root-commit) 4387c8c] updated database for practice
 1 file changed, 281 insertions(+)
 create mode 100644 Untitled.ipynb
Enumerating objects: 3, done.
Counting objects: 100% (3/3), done.
Delta compression using up to 20 threads
Compressing objects: 100% (2/2), done.
Writing objects: 100% (3/3), 1.89 KiB | 1.89 MiB/s, done.
Total 3 (delta 0), reused 0 (delta 0)
To github.com:Aipeni/sql_playgorund.git
 * [new branch]      master -> master